#### Terraform Plan 📝

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
[0m[1mgoogle_project_service.required_apis["cloudscheduler.googleapis.com"]: Refreshing state... [id=shorted-dev-aba5688f/cloudscheduler.googleapis.com][0m
[0m[1mgoogle_project_service.required_apis["compute.googleapis.com"]: Refreshing state... [id=shorted-dev-aba5688f/compute.googleapis.com][0m
[0m[1mgoogle_project_service.required_apis["secretmanager.googleapis.com"]: Refreshing state... [id=shorted-dev-aba5688f/secretmanager.googleapis.com][0m
[0m[1mgoogle_project_service.required_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=shorted-dev-aba5688f/artifactregistry.googleapis.com][0m
[0m[1mgoogle_project_service.required_apis["iam.googleapis.com"]: Refreshing state... [id=shorted-dev-aba5688f/iam.googleapis.com][0m
[0m[1mgoogle_project_service.required_apis["run.googleapis.com"]: Refreshing state... [id=shorted-dev-aba5688f/run.googleapis.com][0m
[0m[1mgoogle_artifact_registry_repository.shorted: Refreshing state... [id=projects/shorted-dev-aba5688f/locations/australia-southeast2/repositories/shorted][0m
[0m[1mmodule.shorts_api.google_service_account.shorts_api: Refreshing state... [id=projects/shorted-dev-aba5688f/serviceAccounts/shorts@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.stock_price_ingestion.google_service_account.stock_price_ingestion: Refreshing state... [id=projects/shorted-dev-aba5688f/serviceAccounts/stock-price-ingestion@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.short_data_sync.google_service_account.scheduler_invoker: Refreshing state... [id=projects/shorted-dev-aba5688f/serviceAccounts/shorts-data-sync-scheduler@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.short_data_sync.google_service_account.short_data_sync: Refreshing state... [id=projects/shorted-dev-aba5688f/serviceAccounts/shorts-data-sync@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.cms.google_service_account.cms: Refreshing state... [id=projects/shorted-dev-aba5688f/serviceAccounts/shorted-cms@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.short_data_sync.google_storage_bucket.short_selling_data: Refreshing state... [id=shorted-short-selling-data][0m
[0m[1mmodule.stock_price_ingestion.google_secret_manager_secret_iam_member.alpha_vantage_api_key: Refreshing state... [id=projects/shorted-dev-aba5688f/secrets/ALPHA_VANTAGE_API_KEY/roles/secretmanager.secretAccessor/serviceAccount:stock-price-ingestion@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.stock_price_ingestion.google_secret_manager_secret_iam_member.database_url: Refreshing state... [id=projects/shorted-dev-aba5688f/secrets/DATABASE_URL/roles/secretmanager.secretAccessor/serviceAccount:stock-price-ingestion@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.short_data_sync.google_secret_manager_secret_iam_member.database_url: Refreshing state... [id=projects/shorted-dev-aba5688f/secrets/DATABASE_URL/roles/secretmanager.secretAccessor/serviceAccount:shorts-data-sync@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.short_data_sync.google_storage_bucket_iam_member.short_data_sync_bucket: Refreshing state... [id=b/shorted-short-selling-data/roles/storage.objectAdmin/serviceAccount:shorts-data-sync@shorted-dev-aba5688f.iam.gserviceaccount.com][0m
[0m[1mmodule.cms.google_cloud_run_v2_service.cms: Refreshing state... [id=projects/shorted-dev-aba5688f/locations/australia-southeast2/services/cms][0m
[0m[1mmodule.shorts_api.google_secret_manager_secret_iam_member.postgres_password: Refreshing state... [id=projects/shorted-dev-aba5688f/secrets/APP_STORE_POSTGRES_PASSWORD/roles/secretmanager.secretAccessor/serviceAccount:shorts@shorted-dev-aba5688f.iam.gserviceaccount.com][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform planned the following actions, but then encountered a problem:

[1m  # module.cms.google_cloud_run_v2_service.cms[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_cloud_run_v2_service" "cms" {
      [31m-[0m[0m annotations             = {} [90m-> null[0m[0m
      [33m~[0m[0m conditions              = [
          [31m-[0m[0m {
              [31m-[0m[0m execution_reason     = ""
              [31m-[0m[0m last_transition_time = "2025-11-03T02:11:26.077252Z"
              [31m-[0m[0m message              = "Image 'australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/cms:latest' not found."
              [31m-[0m[0m reason               = "REVISION_FAILED"
              [31m-[0m[0m revision_reason      = ""
              [31m-[0m[0m severity             = ""
              [31m-[0m[0m state                = "CONDITION_FAILED"
              [31m-[0m[0m type                 = "RoutesReady"
            },
          [31m-[0m[0m {
              [31m-[0m[0m execution_reason     = ""
              [31m-[0m[0m last_transition_time = "2025-11-03T02:11:25.975802Z"
              [31m-[0m[0m message              = "Image 'australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/cms:latest' not found."
              [31m-[0m[0m reason               = ""
              [31m-[0m[0m revision_reason      = ""
              [31m-[0m[0m severity             = ""
              [31m-[0m[0m state                = "CONDITION_FAILED"
              [31m-[0m[0m type                 = "ConfigurationsReady"
            },
        ] -> (known after apply)
      [33m~[0m[0m create_time             = "2025-11-03T02:11:25.542249Z" -> (known after apply)
      [33m~[0m[0m creator                 = "ben@shorted.com.au" -> (known after apply)
      [31m-[0m[0m custom_audiences        = [] [90m-> null[0m[0m
      [32m+[0m[0m delete_time             = (known after apply)
      [33m~[0m[0m effective_annotations   = {} -> (known after apply)
      [33m~[0m[0m etag                    = ""CM2eoMgGEKigyIIC/cHJvamVjdHMvc2hvcnRlZC1kZXYtYWJhNTY4OGYvbG9jYXRpb25zL2F1c3RyYWxpYS1zb3V0aGVhc3QyL3NlcnZpY2VzL2Ntcw"" -> (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [33m~[0m[0m generation              = "1" -> (known after apply)
      [33m~[0m[0m id                      = "projects/shorted-dev-aba5688f/locations/australia-southeast2/services/cms" -> (known after apply)
      [33m~[0m[0m ingress                 = "INGRESS_TRAFFIC_ALL" -> (known after apply)
      [33m~[0m[0m last_modifier           = "ben@shorted.com.au" -> (known after apply)
      [33m~[0m[0m latest_created_revision = "projects/shorted-dev-aba5688f/locations/australia-southeast2/services/cms/revisions/cms-00001-9t4" -> (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [33m~[0m[0m launch_stage            = "GA" -> (known after apply)
        name                    = "cms"
      [33m~[0m[0m observed_generation     = "1" -> (known after apply)
      [33m~[0m[0m reconciling             = false -> (known after apply)
      [33m~[0m[0m terminal_condition      = [
          [31m-[0m[0m {
              [31m-[0m[0m execution_reason     = ""
              [31m-[0m[0m last_transition_time = "2025-11-03T02:11:26.077252Z"
              [31m-[0m[0m message              = "Image 'australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/cms:latest' not found."
              [31m-[0m[0m reason               = "REVISION_FAILED"
              [31m-[0m[0m revision_reason      = ""
              [31m-[0m[0m severity             = ""
              [31m-[0m[0m state                = "CONDITION_FAILED"
              [31m-[0m[0m type                 = "Ready"
            },
        ] -> (known after apply)
      [33m~[0m[0m traffic_statuses        = [] -> (known after apply)
      [33m~[0m[0m uid                     = "6fb93ed6-a7fd-48f9-8640-78196489d8b7" -> (known after apply)
      [33m~[0m[0m update_time             = "2025-11-03T02:11:25.542249Z" -> (known after apply)
      [32m+[0m[0m uri                     = (known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m template {
          [31m-[0m[0m annotations                      = {} [90m-> null[0m[0m
          [31m-[0m[0m labels                           = {} [90m-> null[0m[0m
          [33m~[0m[0m max_instance_request_concurrency = 80 -> (known after apply)
          [31m-[0m[0m session_affinity                 = false [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m containers {
              [31m-[0m[0m args       = [] [90m-> null[0m[0m
              [31m-[0m[0m command    = [] [90m-> null[0m[0m
              [31m-[0m[0m depends_on = [] [90m-> null[0m[0m
              [33m~[0m[0m image      = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/cms:latest" [33m->[0m[0m "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/cms:pr-44"

                [90m# (9 unchanged blocks hidden)[0m[0m
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.cms.google_cloud_run_v2_service_iam_member.cms_access[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "cms_access" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "cms"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.algolia_app_id[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "algolia_app_id" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = "serviceAccount:shorts@shorted-dev-aba5688f.iam.gserviceaccount.com"
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALGOLIA_APP_ID"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.algolia_search_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "algolia_search_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = "serviceAccount:shorts@shorted-dev-aba5688f.iam.gserviceaccount.com"
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALGOLIA_SEARCH_KEY"
    }

[1mPlan:[0m 4 to add, 0 to change, 1 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m cms_url                               = (known after apply)

```

</details>

*Environment: dev*
*Project: shorted-dev-aba5688f*
*Image Tag: pr-44*
